app/controllers/articles_controller.rb

  def show
    @article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @article = Article.find_by(id: params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]