app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @articles = @user.articles.paginate(page: params[:page], per_page: 5).search(params[:search])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]